Tasks/ЗадачаПоОбработкеДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПоОбработкеДокумента</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительНазначенПринудительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Описание результата выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прервана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоставПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодписанныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыполненаИзЗаОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки в результате выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Comment>Плановый срок выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредметаСтрокой</Name>
					<Comment>Используется для сортировки по типу в формах списков задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминанияОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчетаПредельногоСрокаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
					<Comment>При отмене выполнения задачи-предшественника требуется прервать все задачи-последователи</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПредшественник</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачаПоОбработкеДокумента/Forms/МоиЗадачи/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторЗадания, ЗакрытиеПослеОтветаНаВопрос;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
	
	НеЗаполнятьКомментарийПриОтрицательномРезультате = ЗначениеКонстанты_НеЗаполнятьКомментарийПриОтрицательномРезультате();
	ПроверятьИмеющиесяЭППриОчередномПодписании = ЗначениеКонстанты_ПроверятьИмеющиесяЭППриОчередномПодписании();
	ПроверятьПодписанныеДанныеПриОчередномПодписании = ЗначениеКонстанты_ПроверятьПодписанныеДанныеПриОчередномПодписании();
	ПроверятьНаличиеКлючаПЭПВРеестре = ЗначениеКонстанты_ПроверятьНаличиеКлючаПЭПВРеестре();
	ИспользоватьМногопоточнуюПроверку = ЗначениеКонстанты_ИспользоватьПроверкуПодписываемыхДанныхЧерезХэш();
	
	ПриОбновленииСпискаЗадач();
	
	Элементы.СтраницыЭтапыДО.ТекущаяСтраница = Элементы.Этапы; 
	
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", Пользователи.АвторизованныйПользователь());
	
	// Установка отбора динамического списка.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно, , ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "ТипДокумента", , Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Предмет", , , Истина, Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Ссылка.Предмет", Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "ИдентификаторПачкиЗадач", , Истина, Истина, Истина);
	
	ПроцессыОбработкиДокументов.ДобавитьДополнительныеКолонкиСпискаЗадач(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ИдентификаторЗадания = Неопределено
		ИЛИ ЗакрытиеПослеОтветаНаВопрос = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если ЗавершениеРаботы Тогда
		ТекстПредупреждения = НСтр("ru='Задачи по обработке документов еще выполняются. При завершении работы их выполнение будет продолжено в фоновом режиме.'");
		Возврат;
	КонецЕсли;
	
	ЗакрытиеПослеОтветаНаВопрос = Неопределено;
	
	ПараметрыОповещения = Новый Структура("ЗакрытьФорму", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрерватьОперациюПослеОтветаНаВопрос", ЭтотОбъект, ПараметрыОповещения);
	
	ТекстВопроса = НСтр("ru = 'Задачи еще выполняются. Прервать их выполнение при закрытии формы?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	СгруппироватьПоКолонкеНаСервере(Настройки["РежимГруппировки"]);
	УстановитьОтбор(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗадачаПоОбработкеДокумента"
		ИЛИ ИмяСобытия = "Запись_ШаблонПроцесса" Тогда
		ОбновитьСписокЗадачНаСервере();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
		И Источник = "НеЗаполнятьКомментарийПриОтрицательномРезультате" Тогда
		НеЗаполнятьКомментарийПриОтрицательномРезультате = ЗначениеКонстанты_НеЗаполнятьКомментарийПриОтрицательномРезультате();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
		И Источник = "ПроверятьИмеющиесяЭППриОчередномПодписании" Тогда
		ПроверятьИмеющиесяЭППриОчередномПодписании = ЗначениеКонстанты_ПроверятьИмеющиесяЭППриОчередномПодписании();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
		И Источник = "ПроверятьПодписанныеДанныеПриОчередномПодписании" Тогда
		ПроверятьПодписанныеДанныеПриОчередномПодписании = ЗначениеКонстанты_ПроверятьПодписанныеДанныеПриОчередномПодписании();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
		И Источник = "ПроверятьНаличиеКлючаПЭПВРеестре" Тогда
		ПроверятьНаличиеКлючаПЭПВРеестре = ЗначениеКонстанты_ПроверятьНаличиеКлючаПЭПВРеестре();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
		И (Источник = "ИспользоватьЭППриВыполненииЭтапов"
			ИЛИ Источник = "ИспользоватьПростыеЭППриВыполненииЭтапов") Тогда
		ПерезаполнитьКнопкиСКомандамиРезультатовВыполнения();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УправлениеВидимостьюКомандПринятияКИсполнению(Элемент.ТекущиеДанные);
	УправлениеВидимостьюКомандОтменитьВыполнение(Элемент.ТекущиеДанные);
	УправлениеВидимостьюКомандВернутьНаРольИсполнителя(Элемент.ТекущиеДанные);
	УправлениеВидимостьюКомандИнформацияОбОшибке(Элемент.ТекущиеДанные);
	УправлениеВидимостьюКомандПрерватьВыполнение(Элемент.ТекущиеДанные);
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыРезультатовВыполнения");
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыРезультатовВыполнения", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Предмет") Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предмет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгруппироватьПоБезГруппировки(Команда)
	СгруппироватьПоКолонке("");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоАвтору(Команда)
	СгруппироватьПоКолонке("Автор");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоПредмету(Команда)
	СгруппироватьПоКолонке("ТипДокумента");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоЭтапу(Команда)
	СгруппироватьПоКолонке("Этап");
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ПринятьЗадачиКИсполнению(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКомандПринятияКИсполнению(Элементы.Список.ТекущиеДанные);
	УправлениеВидимостьюКомандВернутьНаРольИсполнителя(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПринятиеКИсполнению(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьПринятиеЗадачКИсполнению(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКомандПринятияКИсполнению(Элементы.Список.ТекущиеДанные);
	УправлениеВидимостьюКомандВернутьНаРольИсполнителя(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаРольИсполнителя(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ВернутьНаРольИсполнителя(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКомандВернутьНаРольИсполнителя(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнформацияОбОшибке(Команда)
	ПроцессыОбработкиДокументовКлиент.ПоказатьИнформациюОбОшибках(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьВыполнениеЗадач(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКомандОтменитьВыполнение(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	ОбновитьСписокЗадачНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыРезультатовВыполнения()
	
	ПустойИдентификатор = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
	ОбщийЭтап = Неопределено;
	
	Для Каждого Задача Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		ДанныеЗадачи = Элементы.Список.ДанныеСтроки(Задача);
		Если ДанныеЗадачи.Выполнена Тогда
			ОбщийЭтап = Неопределено;
			Прервать;
		КонецЕсли;
		Если ДанныеЗадачи.ИдентификаторПачкиЗадач <> ПустойИдентификатор Тогда
			ОбщийЭтап = Неопределено;
			Прервать;
		ИначеЕсли НЕ ЗначениеЗаполнено(ОбщийЭтап) Тогда
			ОбщийЭтап = ДанныеЗадачи.Этап;
		ИначеЕсли ОбщийЭтап <> ДанныеЗадачи.Этап Тогда
			ОбщийЭтап = Неопределено;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Команда Из ТаблицаКоманд Цикл
		ВидимостьКоманды = Команда.Этап = ОбщийЭтап;
		Если Элементы[Команда.ИмяКнопки].Видимость <> ВидимостьКоманды Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Команда.ИмяКнопки, "Видимость", ВидимостьКоманды);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ПроцессыОбработкиДокументовКлиент.ВыполнитьЗадачи(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = ПроцессыОбработкиДокументовВызовСервера.НачатьВыполнениеЗадач(Контекст, УникальныйИдентификатор);
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
		
	Иначе
		
		ИдентификаторПачки = Контекст.ИдентификаторПачки;
		ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
		
		СостояниеДлительнойОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = 'Выполнено 0 из %1 задач'"),
										Контекст.ДанныеДокументов.Количество());
		
		УправлениеДоступностьюЭлементовПриВыполненииВФоне(Истина);
		
		Элементы.СтраницыЭтапыДО.ТекущаяСтраница = Элементы.ДлительнаяОперация;
		
		ПроцессыОбработкиДокументовКлиент.ОжидатьЗавершениеВыполненияЗадач(ЭтотОбъект, ДлительнаяОперация, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеЗадачПоОбработкеДокументовПрогресс(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Прогресс.Прогресс <> Неопределено Тогда
		
		СостояниеДлительнойОперации = Прогресс.Прогресс.Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииВыполненияДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт
	
	ПриЗавершенииВыполненияЗадач();
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьДлительнуюОперацию(Команда)
	
	ПараметрыОповещения = Новый Структура("ЗакрытьФорму", Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрерватьОперациюПослеОтветаНаВопрос", ЭтотОбъект, ПараметрыОповещения);
	
	ТекстВопроса = НСтр("ru = 'Задачи еще выполняются. При прерывании операции часть задач останется невыполненной.
					|Прервать?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьОперациюПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да
		И ИдентификаторЗадания <> Неопределено Тогда
		ОтменитьВыполнениеДлительнойОперации(ИдентификаторЗадания);
		ПриЗавершенииВыполненияЗадач(Истина);
	КонецЕсли;
	
	Если Параметры.ЗакрытьФорму Тогда
		ЗакрытиеПослеОтветаНаВопрос = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьВыполнение(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрерватьВыполнениеПослеОтветаНаВопрос", ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru = 'Прервать выполнение задач?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьВыполнениеПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовКлиент.ПрерватьПроцессВыполненияЗадач(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКомандПрерватьВыполнение(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиСПереданнымиПравами(Команда)
	ОткрытьФорму("Задача.ЗадачаПоОбработкеДокумента.Форма.ЗадачиСПереданнымиПравами");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИсполнителяЗадач(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиИсполнителяЗадач", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗначениеКонстанты_НеЗаполнятьКомментарийПриОтрицательномРезультате()
	Возврат Константы.НеЗаполнятьКомментарийПриОтрицательномРезультате.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеКонстанты_ПроверятьИмеющиесяЭППриОчередномПодписании()
	Возврат Константы.ПроверятьИмеющиесяЭППриОчередномПодписании.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеКонстанты_ПроверятьПодписанныеДанныеПриОчередномПодписании()
	Возврат Константы.ПроверятьПодписанныеДанныеПриОчередномПодписании.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеКонстанты_ПроверятьНаличиеКлючаПЭПВРеестре()
	Возврат Константы.ПроверятьНаличиеКлючаПЭПВРеестре.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеКонстанты_ИспользоватьПроверкуПодписываемыхДанныхЧерезХэш()
	Возврат Константы.ИспользоватьПроверкуПодписываемыхДанныхЧерезХэш.Получить();
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ПроцессыОбработкиДокументов.УстановитьОформлениеЗадач(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоКолонке(Знач ИмяКолонкиРеквизита)
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") И ЭлементНастроек.Структура.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Пользовательская настройки группировки будет удалена. Продолжить?'");
			Обработчик = Новый ОписаниеОповещения("ПродолжитьГруппировкуПоКолонкеПослеВопроса", ЭтотОбъект, ИмяКолонкиРеквизита);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонкеПослеВопроса(Результат, ИмяКолонкиРеквизита) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") Тогда
			ЭлементНастроек.Структура.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита)
	
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоКолонкеНаСервере(Знач ИмяКолонкиРеквизита)
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадачНаСервере()
	
	ПриОбновленииСпискаЗадач();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСпискаЗадач()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	ПроцессыОбработкиДокументов.ПроверитьСостояниеВыполняемыхЗадач();
	
	УправлениеВидимостьюОбщихКоманд();
	
	АктивныеФоновыеЗаданияПользователя = Новый ФиксированноеСоответствие(
		ПроцессыОбработкиДокументов.ИдентификаторыАктивныхФоновыхЗаданий());
	
	ПерезаполнитьКнопкиСКомандамиРезультатовВыполнения();
	
	ПроцессыОбработкиДокументов.ЗаполнитьСлужебныеТаблицы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ПараметрыОтбора)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Выполнена");
	Если НЕ ПараметрыОтбора["ПоказыватьВыполненные"] Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Выполнена", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьКнопкиСКомандамиРезультатовВыполнения()
	ПроцессыОбработкиДокументов.УдалитьКнопкиСКомандамиРезультатовВыполнения(ЭтотОбъект);
	ПроцессыОбработкиДокументов.СоздатьКнопкиСКомандамиРезультатовВыполнения(ЭтотОбъект, "Этапы");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКомандПринятияКИсполнению(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
	ИначеЕсли НЕ ТекущиеДанные.Свойство("ПринятаКИсполнению") Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("Выполнена")
		И ТекущиеДанные.Выполнена Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
	ИначеЕсли НЕ ТекущиеДанные.ПринятаКИсполнению Тогда
		ДоступностьПринятьКИсполнению = Истина;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ИсполнительНазначенПринудительно")
		И ТекущиеДанные.ИсполнительНазначенПринудительно Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
	Иначе
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Истина;
	КонецЕсли;
	
	Элементы.ПринятьКИсполнению.Доступность = ДоступностьПринятьКИсполнению;
	Элементы.СписокКонтекстноеМенюПринятьКИсполнению.Доступность = ДоступностьПринятьКИсполнению;
	Элементы.ОтменитьПринятиеКИсполнению.Доступность = ДоступностьОтменитьПринятиеКИсполнению;
	Элементы.СписокКонтекстноеМенюОтменитьПринятиеКИсполнению.Доступность = ДоступностьОтменитьПринятиеКИсполнению;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКомандВернутьНаРольИсполнителя(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Свойство("ПринятаКИсполнению")
		И ТекущиеДанные.Свойство("Исполнитель")
		И ТекущиеДанные.Свойство("РольИсполнителя")
		И НЕ ТекущиеДанные.ПринятаКИсполнению
		И ЗначениеЗаполнено(ТекущиеДанные.Исполнитель)
		И ЗначениеЗаполнено(ТекущиеДанные.РольИсполнителя) Тогда
		Элементы.СписокКонтекстноеМенюВернутьНаРольИсполнителя.Доступность = Истина;
	Иначе
		Элементы.СписокКонтекстноеМенюВернутьНаРольИсполнителя.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКомандОтменитьВыполнение(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Свойство("Выполнена")
		И ТекущиеДанные.Свойство("Прервана")
		И ТекущиеДанные.Выполнена
		И НЕ ТекущиеДанные.Прервана Тогда
		Элементы.ОтменитьВыполнение.Доступность = Истина;
		Элементы.СписокКонтекстноеМенюОтменитьВыполнение.Доступность = Истина;
	Иначе
		Элементы.ОтменитьВыполнение.Доступность = Ложь;
		Элементы.СписокКонтекстноеМенюОтменитьВыполнение.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКомандИнформацияОбОшибке(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Свойство("НеВыполненаИзЗаОшибки")
		И ТекущиеДанные.НеВыполненаИзЗаОшибки Тогда
		Элементы.ИнформацияОбОшибке.Доступность = Истина;
		Элементы.СписокКонтекстноеМенюИнформацияОбОшибке.Доступность = Истина;
	Иначе
		Элементы.ИнформацияОбОшибке.Доступность = Ложь;
		Элементы.СписокКонтекстноеМенюИнформацияОбОшибке.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКомандПрерватьВыполнение(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Свойство("ИдентификаторПачкиЗадач")
		И АктивныеФоновыеЗаданияПользователя.Получить(Строка(ТекущиеДанные.ИдентификаторПачкиЗадач)) <> Неопределено Тогда
		Элементы.ПрерватьВыполнение.Доступность = Истина;
		Элементы.СписокКонтекстноеМенюПрерватьВыполнение.Доступность = Истина;
	Иначе
		Элементы.ПрерватьВыполнение.Доступность = Ложь;
		Элементы.СписокКонтекстноеМенюПрерватьВыполнение.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюЭлементовПриВыполненииВФоне(ЗапущеноФоновоеЗадание)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяКоманднаяПанель", "Доступность", НЕ ЗапущеноФоновоеЗадание);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Список", "Доступность", НЕ ЗапущеноФоновоеЗадание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииВыполненияЗадач(ДосрочноеЗавершение = Ложь)
	
	УправлениеДоступностьюЭлементовПриВыполненииВФоне(Ложь);
	
	Элементы.СтраницыЭтапыДО.ТекущаяСтраница = Элементы.Этапы;
	
	ИдентификаторЗадания = Неопределено;
	СостояниеДлительнойОперации = "";
	
	Если ДосрочноеЗавершение Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
		ОбновитьСписокЗадачНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеДлительнойОперации(ИдентификаторЗадания)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюОбщихКоманд()
	
	Информация = ПроцессыОбработкиДокументов.ИнформацияОПереданныхПравахИсполнителю(Пользователи.ТекущийПользователь());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗадачиСПереданнымиПравами", "Видимость", Информация.ИсполнителюПереданыПрава);
	
	ЗаголовокКнопки = НСтр("ru = 'Задачи с переданными правами'");
	Если Информация.КоличествоНевыполненныхЗадач > 0 Тогда
		ЗаголовокКнопки = ЗаголовокКнопки + " (" + Строка(Информация.КоличествоНевыполненныхЗадач) + ")";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗадачиСПереданнымиПравами", "Заголовок", ЗаголовокКнопки);
	
КонецПроцедуры

#КонецОбласти
